from flask import Flask, request
from linebot import LineBotApi, WebhookHandler
from linebot.models import (
    MessageEvent, TextMessage,
    TextSendMessage, ImageSendMessage
)
import os

app = Flask(__name__)

line_bot_api = LineBotApi(os.getenv("LINE_ACCESS_TOKEN"))
handler = WebhookHandler(os.getenv("LINE_CHANNEL_SECRET"))

@app.route("/callback", methods=["POST"])
def callback():
    try:
        signature = request.headers["X-Line-Signature"]
        body = request.get_data(as_text=True)
        handler.handle(body, signature)
    except Exception as e:
        print(e)
    return "OK"

@handler.add(MessageEvent, message=TextMessage)
def handle_message(event):
    text = event.message.text.strip().lower()
    if not text:
        return

    commands = (
        "รายงานkiosk", "ยอด", "รายงาน",
        "บัตรครึ่งใบ", "บัตร",
        "wifi", "ci",
        "เบอร์", "เบอ", "เบอร์โทร", "เบอร์โทรศัพท์",
        "ภาษี", "vat",
        "help", "บอท"
    )

    if text not in commands:
        return

    messages = []

    if text in ("help", "บอท"):
        messages.append(TextSendMessage(
            text=(
                "คำสั่งที่ใช้ได้:\n"

                "รายงานkiosk\n"
                "ยอด\n"
                "รายงาน\n"
                "บัตรครึ่งใบ\n" 
                "บัตร\n"
                "Wifi\n"
                "ci\n"
                "เบอร์\n"
                "ภาษี\n"
                 "vat"
            )
        ))

    elif cmd in ("รายงานkiosk", "ยอด", "รายงาน"):
         reply = (
        "📊 รายงานตู้ KIOSK\n"
        "https://smartcargo.airportthai.co.th/aotwebmanagement/reports/KisokreportComponent\n\n"
        "User : wanakorn.poa@proinside.co.th\n"
        "Password : 10101010\n\n"
        "วิธีใช้งาน:\n"
        "ไปที่หัวข้อ A7 รายงาน\n"
        "เลือกไปที่รายงานประจำตู้ KIOSK\n"
        "เช็คที่หัวข้อย่อยที่ 1 กับหัวข้อย่อยที่ 7\n\n"
        "หัวข้อย่อยที่ 1:\n"
        "- รายงานยอดขายตู้ Kiosk\n"
        "- เลือกเช็คทีละตู้\n"
        "- อย่าลืมเลือกวันให้ตรงกับวันที่เช็ค\n\n"
        "หัวข้อย่อยที่ 7:\n"
        "- รายงานสรุปยอดขายรายวัน\n"
        "- เลือกตู้ทั้งหมด\n"
        "- เลือกวันที่ที่จะเช็ค\n\n"
        "ถ้ารายงานตรงกับกระดาษ A4\n"
        "และส่งในกลุ่มทุกเที่ยงคืน\n"
        "ให้แจ้งว่า: รายงานครบทุกตู้"
    )
    elif cmd in ("บัตรครึ่งใบ", "บัตร"):
        reply = (
            "🎫 บัตรครึ่งใบ\n"
            "วิธีแก้ไขปริ้นครึ่งใบ\n"
            "- เช็คว่าฝาปิดสนิทไหม\n"
            "- ปิดสวิตซ์เครื่องปริ้น\n"
            "- ลบ driver โดยการเลือกคำสั่งที่ 2 ลบค่าทั้งหมด\n"
            "- Restart Computer\n"
            "- เปิดสวิตซ์เครื่องปริ้น\n"
            "- ปรับค่าเป็น : ใช้ผ่านความร้อนโดยตรง\n"
            "- Set ค่ากระดาษใหม่เป็น 80 mm 50 mm 0 mm 0mm รวม 4 ช่อง\n"
            "- แล้วเทสผ่าน admin 4 ครั้ง ถ้าได้ก็เปิดใช้ได้ปกติครับ แต่ถ้าไม่ได้ให้เริ่มทำใหม่ที่ข้อ 1 ครับ\n"
            "ถ้าเป็นที่ตู้ 01-09 ต้อง Test อุปกรณ์อื่นๆตามท้ายด้วยครับ เพราะ 9 ตู้นี้ หลังแก้ไขปริ้นเตอร์ อุปกรณ์จะตาย"
        )
    elif cmd in ("Wifi", "ci"):
        reply = ("รหัส  Wifi Ci\n"
         "Pi@FDMS464690")

    elif cmd in ("เบอร์", "เบอ" , "เบอร์โทร", "เบอร์โทรศัพท์"):
        reply = ("เบอร์คนในทีม\n"
        "ฮอน 091-568-8414\n"
        "เบ๊บ 061-818-5046\n"
        "เวย์ 062-462-5538\n"
        "ต้นตาว 099-790-7639\n"
        "บาส 082-315-0099\n"
        "ก๊ก 098-920-0310\n"
        "ดิฟ 091-037-5913")

    elif text in ("ภาษี", "vat"):
        image_url = "https://github.com/vankokeiei/line-group-bot/blob/main/LINE_NOTE_260101_1.jpg?raw=true"
        messages.append(TextSendMessage(text="📄 ตัวอย่างเอกสารภาษี"))
        messages.append(ImageSendMessage(
            original_content_url=image_url,
            preview_image_url=image_url
        ))
    else:
        reply = "ไม่รู้จักคำสั่งนี้ พิมพ์ help , บอท เพื่อดูคำสั่งที่ใช้ได้"

    line_bot_api.reply_message(event.reply_token, messages)

if __name__ == "__main__":
    app.run(port=50000)
    