from flask import Flask, request
from linebot import LineBotApi, WebhookHandler
from linebot.models import MessageEvent, TextMessage, TextSendMessage
import os

app = Flask(__name__)

line_bot_api = LineBotApi(os.getenv("LINE_ACCESS_TOKEN"))
handler = WebhookHandler(os.getenv("LINE_CHANNEL_SECRET"))

@app.route("/callback", methods=["POST"])
def callback():
    signature = request.headers["X-Line-Signature"]
    body = request.get_data(as_text=True)
    handler.handle(body, signature)
    return "OK"

@handler.add(MessageEvent, message=TextMessage)
def handle_message(event):
    text = event.message.text.strip()

    # ตอบเฉพาะคำสั่ง !
    if not text.startswith("!"):
        return

    cmd = text.split()[0]

    if cmd == "!help":
        reply = (
            "คำสั่งที่ใช้ได้:\n"
            "รายงานkiosk\n"
            "ยอด\n"
            "รายงาน\n"
            "บัตรครึ่งใบ\n"
            "บัตร\n"
        )

    elif cmd in ("รายงานkiosk", "ยอด", "รายงาน"):
        reply = (
            "📊 รายงานตู้ KIOSK\n"
            "https://smartcargo.airportthai.co.th/aotwebmanagement/reports/KisokreportComponent\n\n"
            "User : wanakorn.poa@proinside.co.th\n"
            "Password : skyict!@#$567\n\n"
            "วิธีใช้งาน:\n"
            "ไปที่หัวข้อ A7 รายงาน\n"
            "เลือกไปที่รายงานประจำตู้ KIOSK\n"
            "เช็คที่หัวข้อย่อยที่ 1 กับหัวข้อย่อยที่ 7\n\n"
            "หัวข้อย่อยที่ 1:\n"
            "- รายงานยอดขายตู้ Kiosk\n"
            "- เลือกเช็คทีละตู้\n"
            "- อย่าลืมเลือกวันให้ตรงกับวันที่เช็ค\n\n"
            "หัวข้อย่อยที่ 7:\n"
            "- รายงานสรุปยอดขายรายวัน\n"
            "- เลือกตู้ทั้งหมด\n"
            "- เลือกวันที่ที่จะเช็ค\n\n"
            "ถ้ารายงานตรงกับกระดาษ A4\n"
            "และส่งในกลุ่มทุกเที่ยงคืน\n"
            "ให้แจ้งว่า: รายงานครบทุกตู้"
        )
elif cmd in ("บัตรครึ่งใบ", "บัตร"):
        reply = (
            "🎫 บัตรครึ่งใบ\n"
            "วิธีแก้ไขปริ้นครึ่งใบ\n"
            "- เช็คว่าฝาปิดสนิทไหม\n"
            "- ปิดสวิตซ์เครื่องปริ้น\n"
            "- ลบ driver โดยการเลือกคำสั่งที่ 2 ลบค่าทั้งหมด\n"
            "- Restart Computer\n"
            "- เปิดสวิตซ์เครื่องปริ้น\n"
            "- ปรับค่าเป็น ใช้ผ่านความร้อนโดยตรง\n"
            "- Set ค่ากระดาษใหม่เป็น 80 mm 50 mm 0 mm 0mm รวม 4 ช่อง\n"
            "- แล้วเทสผ่าน admin 4 ครั้ง ถ้าได้ก็เปิดใช้ได้ปกติครับ แต่ถ้าไม่ได้ให้เริ่มทำใหม่ที่ข้อ 1 ครับ\n"
            "ถ้าเป็นที่ตู้ 01-09 ต้อง Test อุปกรณ์อื่นๆตามท้ายด้วยครับ เพราะ 9 ตู้นี้ หลังแก้ไขปริ้นเตอร์ อุปกรณ์จะตาย"
        )
    else:
        reply = "ไม่รู้จักคำสั่งนี้ พิมพ์ !help"

    line_bot_api.reply_message(
        event.reply_token,
        TextSendMessage(text=reply)
    )

if __name__ == "__main__":
    app.run(port=5000)